第六章 进程结构

6.0 本章学习的内容
{
    1.进程上下文
    2.系统存储方案
    3.sleep和wakeup算法
}

6.1 进程上下文
{
    6.1.1 进程的状态
    {
        1.进程在用户态下正在执行
        2.进程在和心态下正在执行
        3.进程未被执行，但处于就绪状态，只要内核调度到它，即可执行。
        4.进程正在睡眠并驻留在主存中。
        5.进程处于就绪状态。但对换进程(进程0)必须把它换入主存，内核才能调度它去执行。
        6.进程正在睡眠。对换进程把它换到二级存储器，从而为其他进程腾出空间。
        7.进程正在从核心态返回用户态。但内核抢先于它，并做了上下文切换，以调度另一个进程。
        8.进程刚被创建的状态。这个状态是除了进程0之外的所有进程的初始状态。
        9.进程处于僵死状态。
    }

    6.1.2 描述进程状态的内核数据结构
    {
        相应的数据结构：进程表项和u区
        进程表中的域对于内核来说必须是可存取的
        u区中的域只能由正在运行的进程来存取

        进程表中的字段
        {
            1.状态字段，标识进程的状态
            2.有一部分字段用于让内核找出对应的进程和其u区在内存或在二级存储器中的位置。内核使用这些字段对进程做上下文切换。
        }
    }
}

6.2 系统存储方案
{
    unix系统上的进程由三个逻辑段组成，它们是正文段、数据段和栈。
    正文段含有一个进程所执行的所有指令。
    编译程序在一定范围的虚地址空间生成地址，机器的存储管理部件将虚地址转换成物理存储器中的地址单元。
    
    6.2.1 区
    {
        进程的虚地址空间分成若干个逻辑区。
        正文、数据及段通常形成一个进程的几个独立区。
    }
}